**What is Pandas?**
-


Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

In [2]:
import pandas as pd
import numpy as np

mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [3]:
dict1 = {
    'name': ['harry', 'rohan', 'skillf','ravi','henil'],
    'marks': [92, 34, 24,75,69],
    'city': ['rampur', 'kolkata', 'antartica','surat','Ankleshwar']
}

df = pd.DataFrame(dict1)
print(df)

     name  marks        city
0   harry     92      rampur
1   rohan     34     kolkata
2  skillf     24   antartica
3    ravi     75       surat
4   henil     69  Ankleshwar

**Dataframe Converting into CSV**
-

In [4]:
df.to_csv('first_csv_File_with_Index.csv')

**Without Index in Converting Dictionary to CSV file**

In [5]:
df.to_csv('first_csv_File_without_Index.csv',index=False)

In [6]:
df

     name  marks        city
0   harry     92      rampur
1   rohan     34     kolkata
2  skillf     24   antartica
3    ravi     75       surat
4   henil     69  Ankleshwar

**df.head(n)**

***it start from the Top Of File ot Data**

***n stands-for (number of rows)***

In [7]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

**df.tail(n)**

**it start from the End Of File ot Data**

***n stands-for (number of rows)***

In [8]:
df.tail(2)

    name  marks        city
3   ravi     75       surat
4  henil     69  Ankleshwar

**Describe() Function**

**it apply mathematics formuala on entire dataframe or all data
& Apply like : count, mean, std, min, max, 25%, 50%, 75%**

In [9]:
df.describe()

           marks
count   5.000000
mean   58.800000
std    28.700174
min    24.000000
25%    34.000000
50%    69.000000
75%    75.000000
max    92.000000

**How to Read CSV File in Python**

***syntax***

pd.read('filename.csv)

In [10]:
student = pd.read_csv('Student-Scores.csv')

In [11]:
student

,Unnamed: 0,id,first_name,last_name,email,gender,part_time_job,absence_days,extracurricular_activities,weekly_self_study_hours,career_aspiration,math_score,history_score,physics_score,chemistry_score,biology_score,english_score,geography_score
0,0,1,Ravi,Avaiya,raviavaiya03@gmail.com,male,False,3,False,27,Lawyer,73,81,93,97,63,80,87
1,1,2,Danielle,Sandoval,danielle.sandoval.2@gslingacademy.com,female,False,2,False,47,Doctor,90,86,96,100,90,88,90
2,2,3,Tina,Andrews,tina.andrews.3@gslingacademy.com,female,False,9,True,13,Government Officer,81,97,95,96,65,77,94
3,3,4,Tara,Clark,tara.clark.4@gslingacademy.com,female,False,5,False,3,Artist,71,74,88,80,89,63,86
4,4,5,Anthony,Campos,anthony.campos.5@gslingacademy.com,male,False,5,False,10,Unknown,84,77,65,65,80,74,76
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1995,1995,1996,Alan,Reynolds,alan.reynolds.1996@gslingacademy.com,male,False,2,False,30,Construction Engineer,83,77,84,73,75,84,82
1996,1996,1997,Thomas,Gilbert,thomas.gilbert.1997@gslingacademy.com,male,False,2,False,20,Software Engineer,89,65,73,80,87,67,73
1997,1997,1998,Madison,Cross,madison.cross.1998@gslingacademy.com,female,False,5,False,14,Software Engineer,97,85,63,93,68,94,78
1998,1998,1999,Brittany,Compton,brittany.compton.1999@gslingacademy.com,female,True,10,True,5,Business Owner,51,96,72,89,95,88,75
1999,1999,2000,Natalie,Smith,natalie.smith.2000@gslingacademy.com,female,False,5,False,27,Accountant,82,99,91,69,83,93,100

In [12]:
student['first_name'][0]='Ravi'

C:\Users\ravia\AppData\Local\Temp\ipykernel_10148\2293632286.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  student['first_name'][0]='Ravi'
C:\Users\ravia\AppData\Local\Temp\ipykernel_10148\2293632286.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student['first_name'][0]='Ravi'

In [13]:
student

,Unnamed: 0,id,first_name,last_name,email,gender,part_time_job,absence_days,extracurricular_activities,weekly_self_study_hours,career_aspiration,math_score,history_score,physics_score,chemistry_score,biology_score,english_score,geography_score
0,0,1,Ravi,Avaiya,raviavaiya03@gmail.com,male,False,3,False,27,Lawyer,73,81,93,97,63,80,87
1,1,2,Danielle,Sandoval,danielle.sandoval.2@gslingacademy.com,female,False,2,False,47,Doctor,90,86,96,100,90,88,90
2,2,3,Tina,Andrews,tina.andrews.3@gslingacademy.com,female,False,9,True,13,Government Officer,81,97,95,96,65,77,94
3,3,4,Tara,Clark,tara.clark.4@gslingacademy.com,female,False,5,False,3,Artist,71,74,88,80,89,63,86
4,4,5,Anthony,Campos,anthony.campos.5@gslingacademy.com,male,False,5,False,10,Unknown,84,77,65,65,80,74,76
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1995,1995,1996,Alan,Reynolds,alan.reynolds.1996@gslingacademy.com,male,False,2,False,30,Construction Engineer,83,77,84,73,75,84,82
1996,1996,1997,Thomas,Gilbert,thomas.gilbert.1997@gslingacademy.com,male,False,2,False,20,Software Engineer,89,65,73,80,87,67,73
1997,1997,1998,Madison,Cross,madison.cross.1998@gslingacademy.com,female,False,5,False,14,Software Engineer,97,85,63,93,68,94,78
1998,1998,1999,Brittany,Compton,brittany.compton.1999@gslingacademy.com,female,True,10,True,5,Business Owner,51,96,72,89,95,88,75
1999,1999,2000,Natalie,Smith,natalie.smith.2000@gslingacademy.com,female,False,5,False,27,Accountant,82,99,91,69,83,93,100

In [14]:
student['last_name'][0]='Avaiya'

C:\Users\ravia\AppData\Local\Temp\ipykernel_10148\3376345694.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  student['last_name'][0]='Avaiya'
C:\Users\ravia\AppData\Local\Temp\ipykernel_10148\3376345694.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student['last_name'][0]='Avaiya'

**How to convert to CSV File in pandas**

***syntax***

variable.to_csv('filename.csv)

In [15]:
student.to_csv('Student-Scores.csv',index=False)

In [16]:
pd.read_csv('Student-Scores.csv')

,Unnamed: 0,id,first_name,last_name,email,gender,part_time_job,absence_days,extracurricular_activities,weekly_self_study_hours,career_aspiration,math_score,history_score,physics_score,chemistry_score,biology_score,english_score,geography_score
0,0,1,Ravi,Avaiya,raviavaiya03@gmail.com,male,False,3,False,27,Lawyer,73,81,93,97,63,80,87
1,1,2,Danielle,Sandoval,danielle.sandoval.2@gslingacademy.com,female,False,2,False,47,Doctor,90,86,96,100,90,88,90
2,2,3,Tina,Andrews,tina.andrews.3@gslingacademy.com,female,False,9,True,13,Government Officer,81,97,95,96,65,77,94
3,3,4,Tara,Clark,tara.clark.4@gslingacademy.com,female,False,5,False,3,Artist,71,74,88,80,89,63,86
4,4,5,Anthony,Campos,anthony.campos.5@gslingacademy.com,male,False,5,False,10,Unknown,84,77,65,65,80,74,76
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1995,1995,1996,Alan,Reynolds,alan.reynolds.1996@gslingacademy.com,male,False,2,False,30,Construction Engineer,83,77,84,73,75,84,82
1996,1996,1997,Thomas,Gilbert,thomas.gilbert.1997@gslingacademy.com,male,False,2,False,20,Software Engineer,89,65,73,80,87,67,73
1997,1997,1998,Madison,Cross,madison.cross.1998@gslingacademy.com,female,False,5,False,14,Software Engineer,97,85,63,93,68,94,78
1998,1998,1999,Brittany,Compton,brittany.compton.1999@gslingacademy.com,female,True,10,True,5,Business Owner,51,96,72,89,95,88,75
1999,1999,2000,Natalie,Smith,natalie.smith.2000@gslingacademy.com,female,False,5,False,27,Accountant,82,99,91,69,83,93,100

In [17]:
student['email'][0]='raviavaiya03@gmail.com'

C:\Users\ravia\AppData\Local\Temp\ipykernel_10148\2309437772.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  student['email'][0]='raviavaiya03@gmail.com'
C:\Users\ravia\AppData\Local\Temp\ipykernel_10148\2309437772.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student['email'][0]='raviavaiya03@gmail.com'

In [18]:
student.to_csv('Student-Scores.csv')

In [19]:
student

,Unnamed: 0,id,first_name,last_name,email,gender,part_time_job,absence_days,extracurricular_activities,weekly_self_study_hours,career_aspiration,math_score,history_score,physics_score,chemistry_score,biology_score,english_score,geography_score
0,0,1,Ravi,Avaiya,raviavaiya03@gmail.com,male,False,3,False,27,Lawyer,73,81,93,97,63,80,87
1,1,2,Danielle,Sandoval,danielle.sandoval.2@gslingacademy.com,female,False,2,False,47,Doctor,90,86,96,100,90,88,90
2,2,3,Tina,Andrews,tina.andrews.3@gslingacademy.com,female,False,9,True,13,Government Officer,81,97,95,96,65,77,94
3,3,4,Tara,Clark,tara.clark.4@gslingacademy.com,female,False,5,False,3,Artist,71,74,88,80,89,63,86
4,4,5,Anthony,Campos,anthony.campos.5@gslingacademy.com,male,False,5,False,10,Unknown,84,77,65,65,80,74,76
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1995,1995,1996,Alan,Reynolds,alan.reynolds.1996@gslingacademy.com,male,False,2,False,30,Construction Engineer,83,77,84,73,75,84,82
1996,1996,1997,Thomas,Gilbert,thomas.gilbert.1997@gslingacademy.com,male,False,2,False,20,Software Engineer,89,65,73,80,87,67,73
1997,1997,1998,Madison,Cross,madison.cross.1998@gslingacademy.com,female,False,5,False,14,Software Engineer,97,85,63,93,68,94,78
1998,1998,1999,Brittany,Compton,brittany.compton.1999@gslingacademy.com,female,True,10,True,5,Business Owner,51,96,72,89,95,88,75
1999,1999,2000,Natalie,Smith,natalie.smith.2000@gslingacademy.com,female,False,5,False,27,Accountant,82,99,91,69,83,93,100

**DataFrame**
-

***it's a two dimensional data structure with columns of different types of data***

In [20]:
type(student)

pandas.core.frame.DataFrame

In [21]:
newdf = pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [22]:
type(newdf)
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.476759    0.497843    0.493503    0.499228    0.523899
std      0.284046    0.279378    0.289592    0.287804    0.283415
min      0.002528    0.006199    0.000733    0.002168    0.003569
25%      0.234842    0.268777    0.249759    0.243958    0.297891
50%      0.450130    0.497253    0.497143    0.508549    0.530265
75%      0.724074    0.741496    0.737796    0.753616    0.779356
max      0.998181    0.998515    0.998689    0.995022    0.996222

**dtypes function**
-

In [30]:
newdf.dtypes
newdf[0][0]="Ravi"
newdf.index
newdf.columns
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,Ravi,0.218776,0.818224,0.230013,0.104098,0.932959,0.151825,0.106177,0.108938,0.670232,...,0.993595,0.454512,0.009603,0.406156,0.748933,0.054304,0.770639,0.205968,0.847603,0.132642
1,0.266262,0.135643,0.364997,0.343566,0.246649,0.085123,0.692251,0.310424,0.73558,0.233134,...,0.741783,0.059631,0.551219,0.108805,0.656677,0.545521,0.849339,0.496697,0.202612,0.340373
2,0.736564,0.795478,0.321503,0.986233,0.195393,0.459473,0.918862,0.930894,0.378208,0.007248,...,0.710419,0.160837,0.388527,0.956225,0.121957,0.838472,0.351832,0.684149,0.757241,0.653638
3,0.64034,0.720615,0.109867,0.154274,0.51156,0.873633,0.310217,0.840284,0.59179,0.951776,...,0.631878,0.853724,0.382639,0.880747,0.208535,0.643591,0.168139,0.097366,0.281947,0.600654
4,0.246313,0.799226,0.877872,0.185635,0.828936,0.278186,0.852036,0.677563,0.465029,0.562631,...,0.949546,0.296171,0.286267,0.962055,0.59118,0.35643,0.514204,0.843107,0.099931,0.811157

In [31]:
newdf

            0         1         2         3         4
0        Ravi  0.266262  0.736564  0.640340  0.246313
1    0.218776  0.135643  0.795478  0.720615  0.799226
2    0.818224  0.364997  0.321503  0.109867  0.877872
3    0.230013  0.343566  0.986233  0.154274  0.185635
4    0.104098  0.246649  0.195393  0.511560  0.828936
..        ...       ...       ...       ...       ...
329  0.054304  0.545521  0.838472  0.643591  0.356430
330  0.770639  0.849339  0.351832  0.168139  0.514204
331  0.205968  0.496697  0.684149  0.097366  0.843107
332  0.847603  0.202612  0.757241  0.281947  0.099931
333  0.132642  0.340373  0.653638  0.600654  0.811157

[334 rows x 5 columns]

**Shorting in DataFrame**

In [34]:
newdf.sort_index(axis=0,ascending=False)
#Row Sorting

            0         1         2         3         4
333  0.132642  0.340373  0.653638  0.600654  0.811157
332  0.847603  0.202612  0.757241  0.281947  0.099931
331  0.205968  0.496697  0.684149  0.097366  0.843107
330  0.770639  0.849339  0.351832  0.168139  0.514204
329  0.054304  0.545521  0.838472  0.643591  0.356430
..        ...       ...       ...       ...       ...
4    0.104098  0.246649  0.195393  0.511560  0.828936
3    0.230013  0.343566  0.986233  0.154274  0.185635
2    0.818224  0.364997  0.321503  0.109867  0.877872
1    0.218776  0.135643  0.795478  0.720615  0.799226
0        Ravi  0.266262  0.736564  0.640340  0.246313

[334 rows x 5 columns]

In [35]:
newdf.sort_index(axis=1,ascending=False)
#Columns sorting

            4         3         2         1         0
0    0.246313  0.640340  0.736564  0.266262      Ravi
1    0.799226  0.720615  0.795478  0.135643  0.218776
2    0.877872  0.109867  0.321503  0.364997  0.818224
3    0.185635  0.154274  0.986233  0.343566  0.230013
4    0.828936  0.511560  0.195393  0.246649  0.104098
..        ...       ...       ...       ...       ...
329  0.356430  0.643591  0.838472  0.545521  0.054304
330  0.514204  0.168139  0.351832  0.849339  0.770639
331  0.843107  0.097366  0.684149  0.496697  0.205968
332  0.099931  0.281947  0.757241  0.202612  0.847603
333  0.811157  0.600654  0.653638  0.340373  0.132642

[334 rows x 5 columns]

In [36]:
newdf.loc[0,0]=4545

In [37]:
newdf.head(3)

          0         1         2         3         4
0      4545  0.266262  0.736564  0.640340  0.246313
1  0.218776  0.135643  0.795478  0.720615  0.799226
2  0.818224  0.364997  0.321503  0.109867  0.877872

**Series**
-

***it's a one dimensional data structure with holding any types of data***

In [24]:
type(student['email'])

pandas.core.series.Series

In [25]:
ser = pd.Series(np.random.rand(34))
type(ser)

pandas.core.series.Series

In [26]:
ser

0     0.326989
1     0.241261
2     0.132030
3     0.256411
4     0.826335
5     0.198530
6     0.740028
7     0.281922
8     0.690971
9     0.705204
10    0.624780
11    0.194764
12    0.069456
13    0.684444
14    0.925522
15    0.468876
16    0.417376
17    0.446692
18    0.661624
19    0.973655
20    0.238510
21    0.591341
22    0.806858
23    0.834182
24    0.538119
25    0.861460
26    0.901574
27    0.974650
28    0.299397
29    0.308517
30    0.152613
31    0.521031
32    0.429148
33    0.728653
dtype: float64

------------------------------------------------------------------------------------------------------------------------------------------------------------------------